# TransactWithCentralOptions Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
TransactWithCentralOptions Constructor
TransactWithCentralOptions Class See Also
---
Constructs a new TransactWithCentralOptions.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public TransactWithCentralOptions()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
TransactWithCentralOptions()
```

# See Also
TransactWithCentralOptions Class
Autodesk.Revit.DB Namespace